---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueLoadPhaseA
source: html/546d8fdc-3b72-3299-504e-510b532ce0e9.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueLoadPhaseA Property

The TrueLoadPhaseA value of the Electrical System.

## Syntax (C#)
```csharp
public double TrueLoadPhaseA { get; }
```

## Remarks
This property is used to retrieve the TrueLoadPhaseA value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!